{"episodes":[{"slug":"CD-001","number":1,"published_at":1347754500000,"title":"A Resignation, a Land Grab, & a State of Emergency","preview":"Congress returns from vacation, Dennis Cardoza (CA-18) resigns, President Obama continues the 9/11 State of Emergency, FISA is reauthorized, veterans benefits are held hostage, mining companies get a gift from Congress, solar power is attacked, and..."},{"slug":"CD-002","number":2,"published_at":1348343820000,"title":"Iran Sanctions, the Buffett Rule, & a “War on Coal”","preview":"Iran sanctions are signed into law, a gas pipeline gets fast tracked through a NYC park, the Buffett Rule is (sort of) passed, a \"War on Coal\" is not really waged, and more from this week in Congress...   *Signed into law* Sanctions = Shut down trade..."},{"slug":"CD-003","number":3,"published_at":1352600520000,"title":"The Free Market vs. US","preview":"This episode is a history of free market policies implemented around the world for the last fifty years.  The Basics Corporatist system: Its main characteristics are huge transfers of public wealth to private hands, often accompanied by exploding..."},{"slug":"CD-004","number":4,"published_at":1353142800000,"title":"Screw You E.U. & Give Me My Inhaler","preview":"During a slow week in the House of Representatives, inhalers are given relief, airlines are forced to ignore a European carbon law, and trade with Russia is \"normalized.\"  *Mistake in CD003: Pete Sessions, not Jeff Sessions. *  was bill signed into..."},{"slug":"CD-005","number":5,"published_at":1354324500000,"title":"Lame Ducks Return","preview":"During another slow week in Congress, Jesse Jackson Jr. resigns, Nydia Velazquez (NY) ignores a subpoena, the Department of Homeland Security gets investigated, the Senate fights about filibusters, and the Trans-Pacific-Partnership is confirmed as..."},{"slug":"CD-006","number":6,"published_at":1354924260000,"title":"A Shortened Week in Congress","preview":"Rep. Jo Ann Emerson quits Congress to become a lobbying titan, the Coast Guard is funded, Louie Gohmert votes for 'lunatic', GOP confuses net neutrality, and a crisis is engineered during a short week in Congress.   - Represents southeast Missouri:  -..."},{"slug":"CD-007","number":7,"published_at":1355546160000,"title":"The Realities of Solar Power","preview":"Doing nothing, literally, is planned until 12/28 and a special guest helps filter fact from fiction in regards to solar power.  *Correction from CD004:  failed this week.  1 million Primatene Mist (manufactured by Armstrong Pharmaceuticals) inhalers..."},{"slug":"CD-008","number":8,"published_at":1356396840000,"title":"NDAA for 2013","preview":"Congress passes the National Defense Authorization Act for 2013; highlights include lots of money for other countries, a continuation of indefinite detention, Christmas gifts given to Northrup Grumman and other campaign contributors, and rules will..."},{"slug":"CD-009","number":9,"published_at":1357364340000,"title":"What’s In the Fiscal Cliff Bill","preview":"The back story on the \"fiscal cliff\" debacle, the House's sad excuse for a compromise, and the contents of the fiscal cliff bill that became law on 1/3/13.   ‘‘American Taxpayer Relief Act of 2012'' TITLE I—GENERAL TAXES SEC. 101. PERMANENT..."},{"slug":"CD-010","number":10,"published_at":1358580360000,"title":"House (Finally!) Votes On Sandy Aid","preview":"Before the House (finally) agreed to give recovery money to Hurricane Sandy victims, they made new rules for the 113th Congress, including more private jets for themselves and less rights for gays. Then, despite Republican efforts to short them, the..."},{"slug":"CD-011","number":11,"published_at":1359243060000,"title":"No Budget, Still Get Paid","preview":"Lobbyist Jo Ann Emerson quits Congress early, the House votes to temporarily suspend the debt ceiling and probably-not postpone their own paychecks, and the Brineys drunkenly ramble on a Friday night.  Jo Ann Emerson Resigns from the House  Said she..."},{"slug":"CD-012","number":12,"published_at":1359769740000,"title":"ALEC","preview":"A quick fact check followed by an introduction to ALEC, the association of lawmakers and corporations working together to write bills.  Fact Checking CD011 Conversation   has been reported to be operating in the following countries  Afghanistan Iraq..."},{"slug":"CD-013","number":13,"published_at":1360357380000,"title":"Surveillance, Stupidity, & Drones","preview":"The House passes a surveillance bill masked as pediatric research and then wastes our time. Also, highlights from the leaked legal justification for the Obama Administration's \"lawful\" drone bombing of American citizens.   Introduced by Democrat Lois..."},{"slug":"CD-014","number":14,"published_at":1360977480000,"title":"Marching Towards Sequester","preview":"Hydropower and veterans get some love from the House this week, while churches get taxpayer money and Federal workers get screwed… again.   * Fast Tracks licensing for hydro-power generation on existing dams. * Passed with 0 No votes. * Only 3% of..."},{"slug":"CD-015","number":15,"published_at":1361586720000,"title":"Who Caused Sequester?","preview":"House Republicans tried hard during their week off to label the huge March 1 cuts as \"the President's sequester\", but was President Obama really the cause? We go back to August 1, 2011, the day sequester was born, to see who was celebrating the cuts..."},{"slug":"CD-016","number":16,"published_at":1362146400000,"title":"They Want Cuts","preview":"No one really tried to avert the sequester, the House of Representatives travels in style, and something good actually happened this week in Congress.    Sequester Here is a rundown of what kind of effort each division of Congress put forth to..."},{"slug":"CD-017","number":17,"published_at":1362787440000,"title":"VAWA & Funding Defense","preview":"We take a close look at the Violence Against Women Act re-authorization as the President signs it into law. We also look at the continuing resolution passed by the House, which funds defense while leaving the rest of the government in chaos.   Was..."},{"slug":"CD-018","number":18,"published_at":1363471380000,"title":"The Ryan Budget","preview":"Low-lights of the Ryan budget are described after we run down the bills passed by the House this week. We also look into an eighteen-year emergency continued this week by President Obama.   The banks currently have to send out a notice regarding their..."},{"slug":"CD-019","number":19,"published_at":1364079300000,"title":"Continuing Resolution, Part 1","preview":"Part 1 of a two part series on the continuing resolution that will fund the government until the end of September. In this episode, we examine the funding for the Department of Agriculture, Department of Commerce, Department of Justice, and science..."},{"slug":"CD-020","number":20,"published_at":1364583600000,"title":"Continuing Resolution, Part 2","preview":"Part 2 of the Continuing Resolution which funds the government until September 30th. In this section, we look at the funding for the Defense Department and the Department of Homeland Security.   B= Billion M= Million DIVISION C: DEFENSE DEPARTMENT..."},{"slug":"CD-021","number":21,"published_at":1365304860000,"title":"Trailblazer vs. ThinThread","preview":"Part 3 of the continuing resolution followed by a history of Trailblazer and ThinThread, the NSA's spying programs. *Forward to 28:20 to hear the Trailblazer vs. Thinthread (NSA spying) story* Executive Producer: Kevin   B= Billion M= Million DIVISION..."},{"slug":"CD-022","number":22,"published_at":1365809880000,"title":"Crippling the Regulators","preview":"The House passed two bills this week designed to prevent regulation enforcement; one prevents environmental reviews on certain hydro-power projects, the other prevents the National Labor Relations Board from functioning at all.   A small conduit..."},{"slug":"CD-023","number":23,"published_at":1366220460000,"title":"Boston Marathon","preview":"This episode is dedicated to my family, friends, and neighbors in Boston."},{"slug":"CD-024","number":24,"published_at":1366515840000,"title":"Let’s Gut the STOCK Act","preview":"In the hours before the Boston marathon bombing, President Obama quietly signed a bill gutting the STOCK Act. Full details on the shady way both houses of Congress passed the bill in under two days. Executive Producer: Anonymous Please Support..."},{"slug":"CD-025","number":25,"published_at":1366857240000,"title":"What’s in CISPA?","preview":", better known as CISPA, passed the House of Representatives and is now moving into the Senate. It's a better bill than it was in the last Congress, but it's still not ready to become law.  Links to information in this podcast Music:  by  (found on ) ..."},{"slug":"CD-026","number":26,"published_at":1367023980000,"title":"A Tale of Two Bills","preview":"The House worked on two bills this week. H.R. 527, which changes the way we sell helium, passed in a beautifully bipartisan way. H.R. 1549, which dismantles a piece of ObamaCare, died a uniquely Republican death.  Links to Information in this Episode..."},{"slug":"CD-027","number":27,"published_at":1368229740000,"title":"Overtime","preview":"After a health care rant, we look at H.R. 1406, a bill that would have allowed workers to get vacation time instead of cash for their overtime. It's a bill I'd actually like to see survive.  Links to Information in this Episode   Music:  by    Music: ..."},{"slug":"CD-028","number":28,"published_at":1368897360000,"title":"The IRS Scandal","preview":"In this episode, highlights from the House Ways and Means Committee IRS scandal hearing. IRS staffers made a list of keywords including Tea Party, 9-12, Patriot, etc. to help them find social welfare groups applying for tax exempt status that were..."},{"slug":"CD-029","number":29,"published_at":1369431120000,"title":"Keystone XL Pipeline","preview":"The House passed , a bill waiving permit requirements for the Keystone XL tar sands pipeline and passed , a bill that could raise interest rates for college students while tying their rates to the market. Links to Information in this Episode: Music: ..."},{"slug":"CD-030","number":30,"published_at":1370653500000,"title":"Military Construction & Anti-Biotics","preview":"In this episode, a look at the House's 2014 military construction and veterans funding bill's first-draft and then examine whether it's wise to continue a system that fast-tracks applications for animal anti-biotics. Links to Information in this..."},{"slug":"CD-031","number":31,"published_at":1371261060000,"title":"First Draft of 2014 NDAA","preview":"In this episode, we take a look at the first draft of the 2014 Department of Defense funding bill and see what it tells us about the United States future in war. We also look at three bills the House passed for Wall Street. Links to Information in..."},{"slug":"CD-032","number":32,"published_at":1371851340000,"title":"The Abortion Bill","preview":"In this episode, the House schedule has Jen frustrated, the House Farm Bill unexpectedly dies, and the House passes an abortion bill. Links to Information in This Episode  Congress wants to get rid of      , the abortion bill  Representatives Quoted..."},{"slug":"CD-033","number":33,"published_at":1372527360000,"title":"Let’s Deepwater Drill","preview":"In this episode, the House of Representatives tries to approve ultra-deepwater drilling in the \"Western Gap\": The middle of the Gulf of Mexico. Links to Information in This Episode    The Outer Continental Shelf Transboundary Hydrocarbon Agreements..."},{"slug":"CD-034","number":34,"published_at":1373171700000,"title":"Let’s Drill Offshore","preview":"Before taking a week off for July 4th, the House passed a bill forcing the Obama administration to sell offshore leases to the oil and gas industry.  Links to Information from this Episode Music:  by  (found on )   President Obama put a  after the..."},{"slug":"CD-035","number":35,"published_at":1373698920000,"title":"Energy & Water","preview":"Most of this episode is dedicated to the Energy & Water funding bill that passed the House of Representatives; however, the House also pulled a fast one this week, passing a 608-page agriculture bill that was available for public-reading for less..."},{"slug":"CD-036","number":36,"published_at":1374281880000,"title":"Factory Farm Bill","preview":"During the week of July 10-11, the House of Representatives passed a funding bill for agriculture programs which had only been available to read for 20 hours. In this episode, we take a closer look at what was in that surprise bill. Links to..."},{"slug":"CD-037","number":37,"published_at":1374862080000,"title":"NSA Spying Debate","preview":"Rep. Justin Amash of Michigan tried to attach an amendment to the Department of Defense funding bill for 2014 which would have limited the government's authority to collect our telephone records. The amendment failed but not by much; the episode..."},{"slug":"CD-038","number":38,"published_at":1376080200000,"title":"Wasting July","preview":"In this episode, we catch up on most of the bills that passed the House during the last two weeks of August. A lot of bills were passed; very few have a prayer of becoming law.  Intro and Exit Music:  by  (found on )   Is now law Covered in detail in..."},{"slug":"CD-039","number":39,"published_at":1376802060000,"title":"The Charter School Bill","preview":"On July 19, 2003, the House of Representatives passed  that would largely eliminate the Federal government's role in K-12 education and expand the number of charter schools in the United States.   stated purpose is to undo a portion of the 2009..."},{"slug":"CD-040","number":40,"published_at":1377495180000,"title":"History of the Department of Homeland Security","preview":"The Department of Homeland Security (DHS) and the Transportation Security Administration (TSA) did not exist before September 11, 2001. In this episode, we look back at the bills that created these new government agencies.  Links to Information in..."},{"slug":"CD-041","number":41,"published_at":1377844680000,"title":"Why Attack Syria?","preview":"While the U.S. Congress remained on vacation, British Parliament was called back to debate a pending attack on Syria. We also look at some facts about Syria that suggest we might be getting into a Shock Doctrine type of situation.  Links to..."},{"slug":"CD-042","number":42,"published_at":1378512300000,"title":"House DHS Funding Bill","preview":"In June 2013, the House of Representatives passed their version of a Department of Homeland Security funding bill. The House prioritizes border security and locking up immigrants at the expense of emergency preparedness and the TSA. Details and much..."},{"slug":"CD-043","number":43,"published_at":1379184660000,"title":"Nothin’","preview":"This week, after Russia took the Syria vote off the House schedule, the House did not fund the government for 2014 despite their September 30th deadline. In this episode, we look at what they did instead.   Links to Information in This Episode..."},{"slug":"CD-044","number":44,"published_at":1379751540000,"title":"Pretend to Defund ObamaCare","preview":"This week the House of Representatives passed a government funding bill that allegedly \"defunds ObamaCare\" but... not really. They also tried to cut food stamps, push nuclear power, exempt mining from environmental regulations, and more...  Links to..."},{"slug":"CD-045","number":45,"published_at":1380323220000,"title":"Stop the Shutdown","preview":"The Senate edited the House's version of the short-term government funding bill, stripping out the language that would not-really defund Obamacare. Full details on the Senate's version, including some surprising good news, and a quick recap of the..."},{"slug":"CD-046","number":46,"published_at":1380579240000,"title":"Shutdown Assured","preview":"In this bonus episode, we take a detailed look at the House GOP's latest version of the short-term government funding bill which would delay the implementation of the Affordable Care Act and therefore guarantee that the government will shut down. ..."},{"slug":"CD-047","number":47,"published_at":1380954000000,"title":"Talking Pointing","preview":"In the hours before the government shutdown, the crisis could have been averted. We take a look at the hours before the deadline and see what Congress has done since they slammed the government's doors shut.  Links to Information in This Episode ..."},{"slug":"CD-048","number":48,"published_at":1381646400000,"title":"The Affordable Care Act (Obamacare)","preview":"For this episode, I read the entire   The following is a resource for finding information within the Patient Protection and Affordable Care Act. My goal was to highlight the portions of the bill that will most directly affect our lives and put them..."},{"slug":"CD-049","number":49,"published_at":1382151540000,"title":"Crisis… Postponed","preview":"The shutdown is over & the debt ceiling postponed; we take a close look at the new law that finally ended the unnecessary crisis.  Links to Information in This Episode Intro and Exit Music:  by  (found on ) Music: Now It's Over by  (found on )..."},{"slug":"CD-050","number":50,"published_at":1382758440000,"title":"Privatize Water Projects","preview":"Now that the government is back up and running and the American public has looked away, the House of Representatives got back to work privatizing our government. H.R. 3080 takes the first steps towards privatization of water projects typically done by..."},{"slug":"CD-051","number":51,"published_at":1383364200000,"title":"Expand Bank Bailouts","preview":"The House passed a bill this week that would expand the number of banks that will be eligible for government bailouts and eliminated rules to prevent the banks from making really risky bets with our money.  New Information (Found Since this Podcast..."},{"slug":"CD-052","number":52,"published_at":1384018200000,"title":" The Trans-Pacific Partnership (TPP)","preview":"The Trans-Pacific Partnership (TPP) is a secret international treaty designed to give corporations power over governments; it is labeled as a \"free trade agreement\". The TPP will likely allow corporate control of the Internet, endanger food safety,..."},{"slug":"CD-053","number":53,"published_at":1384634880000,"title":"TPP – The Leaked Chapter","preview":"The Trans-Pacific Partnership (TPP) is an international treaty being negotiated in almost total secrecy by the United States and eleven other nations. This week, Wikileaks published one of the twenty-nine chapters, . In this episode, we highlight the..."},{"slug":"CD-054","number":54,"published_at":1385185740000,"title":"Hidden Data Act","preview":"A bill marketed as for \"transparency\" appears to keep information secret from the public and gut an oversight board. Taxpayers treat a group of Representatives to an expensive Summer getaway. Cocaine.  HR 2061:  passed the House of Representatives..."},{"slug":"CD-055","number":55,"published_at":1385628540000,"title":"Three Bills for Fossil Fuels","preview":"Before going home for Thanksgiving, the House passed three bills designed to fast-track permits for oil and natural gas drilling. This episode highlights the Congressmen who pushed these bills through the House.  Bill Summaries  passed the House of..."},{"slug":"CD-056","number":56,"published_at":1386385800000,"title":"Fired","preview":"Jen's husband loses his job; in this episode, the political situation that doomed his solar power company. Then we make a rough plan for the future, for ourselves and Congressional Dish. Joe Briney co-hosts.  Links to Information in This Episode ..."},{"slug":"CD-057","number":57,"published_at":1386985380000,"title":"DATA Act-tually Pretty Good","preview":"Hudson Hollister, Executive Director of the , schools Jen on the DATA Act, the bill from . Turns out, the bill is not so bad; In fact, the bill could be really, really good.  Links to Information Presented in This Episode  with a detailed summary of..."},{"slug":"CD-058","number":58,"published_at":1387595280000,"title":"Space Travel, TSA, Wall Street, & Patents","preview":"During the first week of December, the House of Representatives passed bills to extend an insurance program that provides taxpayer bailouts to private space exploration companies, made changes to TSA policies, tried (again) to deregulate Wall Street..."},{"slug":"CD-059","number":59,"published_at":1388823300000,"title":"NDAA 2014","preview":"Congress and President Obama worked together to fast-track a new & unexamined NDAA into law. The new law essentially makes NSA data collection legal, cuts military pensions, and spends an enormous amount of money making sure the United States is..."},{"slug":"CD-060","number":60,"published_at":1389468660000,"title":"Fast Track for TPP","preview":"This week, a bill was introduced in both the House and the Senate that would hand Congress' power to negotiate trade deals, such as the Trans-Pacific Partnership, over to the President. We also look at the budget agreement to get an idea of what..."},{"slug":"CD-061","number":61,"published_at":1391252100000,"title":"State of the Budget","preview":"This episode is a mash-up of the State of the Union and the 2014 budget. We compare the impression President Obama gave us about what to expect for this upcoming year with the reality of what was funded in the last-minute and little-examined budget..."},{"slug":"CD-062","number":62,"published_at":1391905080000,"title":"The Farm Bill","preview":"On February 7, President Obama signed the Farm Bill into law, which will govern our food policy for the next five years. In the new law are cuts to food stamps, an expansion of an extremely generous crop insurance program, bailouts for livestock..."},{"slug":"CD-063","number":63,"published_at":1392508260000,"title":"2013 The Year in Review","preview":"In this episode, Jen and Joe recap all the bills that passed the House of Representatives and were covered on Congressional Dish in 2013. Also, an update on the debt ceiling.  Music in This Episode: Intro and Exit Music:  by ,  by , Debt Ceiling ..."},{"slug":"CD-064","number":64,"published_at":1393223820000,"title":"Chemicals Shall Spill","preview":"In this episode, we catch up on all the bills that passed the House of Representatives in January, including a bill to protect chemical storage companies from having to pay for their messes, a few bills to damage ObamaCare, and a bill to make sure..."},{"slug":"CD-065","number":65,"published_at":1394324640000,"title":"Federal Intervention in California Water Rights","preview":"On February 5, the House of Representatives passed a bill that takes away California's right to divide its dwindling water supply. The bill forces California to take water away from the Sacramento-San Joaquin Bay Delta and give it to Agribusiness in..."},{"slug":"CD-066","number":66,"published_at":1395467040000,"title":"A Hunter’s Point of View","preview":"In early February, the House passed a package of eight bills that are supposed to appeal to hunters and fisherman. For this episode, Jen is joined by Cody Herman, host of  and owner of , who helps Jen understand the bills and discusses whether or not..."},{"slug":"CD-067","number":67,"published_at":1395971220000,"title":"What Do We Want In Ukraine?","preview":"The United States appears prepared to restart the Cold War and loan at least $1 billion of our tax money to Ukraine through the International Monetary Fund (IMF). Why? In this episode, we look at what we're asking for in Ukraine in return for our..."},{"slug":"CD-068","number":68,"published_at":1396676280000,"title":"Ukraine Aid Bill","preview":"We have a new law! President Obama signed a bill loaning a billion dollars and giving another $150 million to Ukraine. In this episode, we find out exactly what's in it and why we are giving money to Ukraine - and other countries in Central and..."},{"slug":"CD-069","number":69,"published_at":1397787480000,"title":"Giving Away Your Land","preview":"In February, the House passed a package of ten bills that give away or sell Federal land, most of them so that private interests can use our land for profit.      To contribute to Congressional Dish, please use the PayPal link below. Thank..."},{"slug":"CD-070","number":70,"published_at":1399093260000,"title":"New Flood Insurance Law","preview":"In March, the President signed into a law some changes to our flood policy law. What is our flood policy law in the United States? How did we change it? Are the changes good?  In the United States, we have a nationalized flood insurance industry. The..."},{"slug":"CD-071","number":71,"published_at":1400368860000,"title":"Our New Laws","preview":"In this episode, we look at all the important bills that become laws since the start of 2014, including a law that might cost you thousands of dollars per year, a law that ends public financing of political party nominating conventions, and a law that..."},{"slug":"CD-072","number":72,"published_at":1401811440000,"title":"The February Bills","preview":"Catching up the the bills that passed the House of Representatives in February, this episode details a bill designed to keep campaign donors secret, a bill to make all regulations more difficult to enact, a bill that makes unlocking your cell phone..."},{"slug":"CD-073","number":73,"published_at":1403649059000,"title":"Amtrak","preview":"In this bonus episode, we look into the state of passenger rail service in the United States by examining the history and current condition of , the only choice for passenger rail service in the nation.  The United States has a third world passenger..."},{"slug":"CD-074","number":74,"published_at":1404461880000,"title":"The March Bills","preview":"This episode highlights the bills that passed the House of Representatives in March, including a bill that allows toxic mountaintop removal waste to be dumped in streams, a bill that skips environmental reviews for new nuclear power plants, a bill..."},{"slug":"CD-075","number":75,"published_at":1406088540000,"title":"The April Bills","preview":"This episode highlights the bills that passed the House of Representatives in April including a bill that makes it tougher for wage slaves to get health insurance, a bill that gives away weapons to other countries, a bill written for the banks that..."},{"slug":"CD-076","number":76,"published_at":1408201140000,"title":"Weapons for the World","preview":"A look at the funding for foreign militaries that might become law as part of the 2015 National Defense Authorization Act (NDAA) that passed the House of Representatives in May. Included is a look at the US funding for Israel's military, the funding..."},{"slug":"CD-077","number":77,"published_at":1409437380000,"title":"The May Bills","preview":"In this episode, we look at a bill that furthers the \"new normal\" in Africa, a bill that sanctions Venezuela, a banking bill, a charter school bill, some silly bills that won't become law, and a few Presidential declarations.  Presidential..."},{"slug":"CD-078","number":78,"published_at":1411027020000,"title":"ISIS ISIL Bogeymen","preview":"In this bonus episode, details and analysis of the authorization to create a new military in Syria which is speeding towards becoming law.    Information Presented in This Episode  Clips in this episode are from the  with testimony from  and . ..."},{"slug":"CD-079","number":79,"published_at":1411431540000,"title":"The June Bills","preview":"This episode highlights the laws and bills that passed the House of Representatives in June. Most of the bills this month were dedicated to cutting corporate taxes and keeping us hooked on fossil fuels.  Laws : WWII Memorial Prayer Act The bill..."},{"slug":"CD-080","number":80,"published_at":1413005100000,"title":"The July Laws","preview":"This episode examines three bills that passed Congress in July and have since become law. The first new law will give veterans quicker access to health care. The second new law is designed to provide job training to poor people, but a hidden provision..."},{"slug":"CD-081","number":81,"published_at":1413584880000,"title":"The July Bills","preview":"In this episode, we look at the bills that passed the House of Representatives in July but haven't yet become law. Topics include tax cuts, student loans, education, Hezbollah, and pesticides in our water.  Please support Congressional Dish:   to..."},{"slug":"CD-082","number":82,"published_at":1414293180000,"title":"Last Bills Before The Election","preview":"In this episode, we discuss the bills that passed in August and September, the last bills to pass before the election. Included are bills that give money to Israel, screw over immigrant kids, audit the Fed, poison the environment, create huge..."},{"slug":"CD-083","number":83,"published_at":1414799520000,"title":"The Story of the 113th Congress","preview":"This episode is the summary of everything that happened in the House of Representatives during the 113th Congress.    Please support Congressional Dish:   to contribute with PayPal or Bitcoin; click the PayPal \"Make it Monthly\" checkbox to create..."},{"slug":"CD-084","number":84,"published_at":1415242140000,"title":"Corporations Win the Midterm Election","preview":"In this episode, the Republicans won control of both the House of Representatives and the Senate. A press conference by soon-to-be Senate Majority Leader Mitch McConnell gives us an idea of what they intend to do with their new power.    Please..."},{"slug":"CD-085","number":85,"published_at":1416949800000,"title":"The November Bills","preview":"After the election, the House of Representatives passed five bills that would help the fossil fuel industry. Included in this episode are a bill to approve the Keystone XL pipeline, a bill to sell off oil-rich public land to a private corporation, and..."},{"slug":"CD-086","number":86,"published_at":1419107520000,"title":"The CRomnibus Hearing","preview":"In this special episode, Matt Acalin joins Jen to watch the only hearing that will ever take place regarding the 1,603 page \"CRomnibus\", which funds most of the government for 2015.  Please support Congressional Dish:   to contribute with PayPal or..."},{"slug":"CD-087","number":87,"published_at":1420485300000,"title":"Run for Congress with Chris Clemmons","preview":"In this episode, an interview with , a member of the Congressional Dish family who ran for the House of Representatives in Kansas' 2nd district. In this episode, we discuss the experience of running for Federal office, the election results, and begin..."},{"slug":"CD-088","number":88,"published_at":1420851900000,"title":"What is the 114th Congress?","preview":"In this bonus episode, a quick overview of Congressional basics. We also examine the priorities of the 114th Congress by reviewing the bills that were passed during its first week.  Please Support Congressional Dish:   to contribute with PayPal or..."},{"slug":"CD-089","number":89,"published_at":1422692820000,"title":"Secrets of the CRomnibus (2015 Budget)","preview":"In this episode, we look at the riders added to the must-sign 2015 budget, including favors for Wall Street, unions, agribusiness, the oil and gas industry, electric utilities, the vending machine industry, telecoms, the trucking industry, the..."},{"slug":"CD-090","number":90,"published_at":1423708680000,"title":"January: Wall Street Gets Some Love","preview":"A summary of January, the first month of the 114th Congress. In this episode, a favor for Wall Street is signed into law, the Senate did almost nothing, and the House passed bills that benefit Wall Street, fossil fuel companies, and companies that..."},{"slug":"CD-091","number":91,"published_at":1425153480000,"title":"DHS Shutdown Averted… For a Week","preview":"In this special episode, catch up on all the drama that surrounded the near shutdown of the Department of Homeland Security. First, sit on the couch with Jen and Matt as they watch the first plan to avert a shutdown go down in flames, then sit in on a..."},{"slug":"CD-092","number":92,"published_at":1425540000000,"title":"The Story of the DHS Almost-Shutdown","preview":"On February 27, 2015 the Department of Homeland Security came within hours of shutting down. In this episode, get the full story, from start to finish, of this unnecessary funding crisis.  Please support Congressional Dish:   to contribute with PayPal..."},{"slug":"CD-093","number":93,"published_at":1426269120000,"title":"Our Future in War","preview":"In this episode, learn about our global war strategy for the 114th Congress through highlights of two Senate Armed Services Committee hearings. Witnesses include former Secretaries of State Henry Kissinger, Madeline Albright, and George Shultz and..."},{"slug":"CD-094","number":94,"published_at":1427564820000,"title":"A Damage-Free February","preview":"A summary of all the bills that passed at least one branch of Congress in February, including six bills destined for a veto and one new law.  Please support Congressional Dish:   to contribute with PayPal or Bitcoin; click the PayPal \"Make it Monthly\"..."},{"slug":"CD-095","number":95,"published_at":1428865800000,"title":"Secret International Regulations (TPA & TPP)","preview":"In this special episode, we prepare for the Senate's upcoming push to fast-track multiple \"free trade\" agreements, including the Trans-Pacific Partnership (TPP). We also look into the January 2015 draft text of the leaked TPP Investment Chapter. ..."},{"slug":"CD-096","number":96,"published_at":1430110680000,"title":"Fast Tracking Fast Track (Trade Promotion Authority)","preview":"Time-sensitive episode! Congress is rushing to pass a bill that would grant the President Trade Promotion Authority (TPA), which hands Congress' power to negotiate international treaties to the Executive Branch. In this episode, we look at the details..."},{"slug":"CD-097","number":97,"published_at":1431549240000,"title":"Nothing Horrible in March","preview":"A resignation, renewed \"national emergencies\", help for a (very) few veterans, screwing over of VA employees and Native Americans, favors for drug companies, changes to Amtrak, a veto threat and more are highlighted from a relatively calm March in..."},{"slug":"CD-098","number":98,"published_at":1433308200000,"title":"USA Freedom Act: Privatization of the Patriot Act","preview":"It's law! The USA Freedom Act, which reauthorizes and privatizes portions of the Patriot Act, is being called a victory for privacy... but it's not. In this episode, find out all the details of the bill that was signed into law just hours after this..."},{"slug":"CD-099","number":99,"published_at":1435441740000,"title":"April Takes a Turn","preview":"Medicare, cybersecurity, favors for banks, mortgages, IRS bullying, a tax cut for the rich, and a couple of good ideas are highlighted from the law and bills that passed Congress in April.  Please support Congressional Dish:   to contribute with..."},{"slug":"CD-100","number":100,"published_at":1437187140000,"title":"Intro to Lobbying with Jack Abramoff","preview":"In this special 100th episode of Congressional Dish, Jen interviews , the most famous lobbyist in the world. After spending 3.5 years in prison, Jack has been speaking out against the systemic corruption he participated in during his time in..."},{"slug":"CD-101","number":101,"published_at":1438364280000,"title":"Trade Away May","preview":"Lots of new laws! Hear all about the final version of fast track and other trade related dingleberries, new measures to combat human trafficking, and new benefits for veterans. In this episode, you'll also learn about the bills that passed at least..."},{"slug":"CD-102","number":102,"published_at":1441093260000,"title":"The World Trade Organization: COOL?","preview":"Do you want to know where your food comes from? Well, Congress is in the process of repealing our Country of Origin Labeling (COOL) law because the World Trade Organization says our meat labels are internationally illegal. In this special episode, we..."},{"slug":"CD-103","number":103,"published_at":1443652080000,"title":"Crazy Busy June","preview":"More bills than anyone could possible read were passed by a branch of Congress in June, including the 994 page National Defense Authorization Act (NDAA), four government funding bills, and thirty bills governing a wide range of topics, including Wall..."},{"slug":"CD-104","number":104,"published_at":1445914680000,"title":"Time for a Change","preview":"A special announcement about the future of Congressional Dish; good things are coming soon!"},{"slug":"CD-105","number":105,"published_at":1446365400000,"title":"Anthrax","preview":"In July, the House of Representatives unanimously passed a bill that would allow expiring anthrax vaccines to be given to civilian emergency responders within the United States. The question: Is that vaccine safe? In this episode, we look at the..."},{"slug":"CD-106","number":106,"published_at":1446985200000,"title":"CISA and Friends","preview":"CISA - the Cybersecurity Information Sharing Act - has officially passed the Senate. While Congress is busy merging CISA with two other so-called cybersecurity bills that passed the House of Representatives, in this episode, by taking an in-depth look..."},{"slug":"CD-107","number":107,"published_at":1447590000000,"title":"New Laws & Veterans’ Health Care","preview":"Good news can be found in this episode! In July, eight bills were signed into law and none of them will make you want to flee the country. Topics covered include veterans and their health care, product warranties, transportation funding, and more. At..."},{"slug":"CD-108","number":108,"published_at":1448194800000,"title":"Regime Change","preview":"Syria: We're told we're at war to fight ISIS/ISIL/Islamic State but in a Congressional hearing that took place the week before the Paris attacks, State Department officials were talking about a different goal. In this episode, highlights from that..."},{"slug":"CD-109","number":109,"published_at":1448801100000,"title":"Know Your GMO with Cara Santa Maria","preview":"joins Jen to discuss a House of Representatives passed bill which creates a national system for labeling genetically modified organisms (GMOs) and prohibits states from enacting their own GMO labeling laws.    Follow Cara on Twitter:  Like Cara..."},{"slug":"CD-110","number":110,"published_at":1449403200000,"title":"Government Funding Crisis of 2015","preview":"Government shutdown ahead! On December 11th, the government is scheduled to run out of money. In this episode, hear the story of how we ended up on the brink of a shutdown (again) and what you can expect in the next few weeks (hint: A huge must-sign..."},{"slug":"CD-111","number":111,"published_at":1450008900000,"title":"Fall 2015 Overview","preview":"Three months of Congress condensed into under one hour. In this episode, we take a look at our new laws, some controversial bills, and the most interesting hearings from September, October, and November. This episode is also a call for feedback: Which..."},{"slug":"CD-112","number":112,"published_at":1450615500000,"title":"Dingle-berries on the Omnibus (2016)","preview":"Available for less than 3 days before the votes, the 2,009 page \"omnibus\" government funding bill was signed into law. History will not look kindly upon provisions that give private companies immunity for forwarding data to the government, make..."},{"slug":"CD-113","number":113,"published_at":1451221380000,"title":"CISA is Law","preview":"Cybersecurity or surveillance? What does the language attached at the last minute to the 2,009 page omnibus government funding bill actually authorize? In this episode, we take a close look at what just became law.    Please support Congressional..."},{"slug":"CD-114","number":114,"published_at":1452431340000,"title":"Trans-Pacific Partnership (TPP) Investment Chapter","preview":"The Trans-Pacific Partnership is finished and will be eligible for a vote in Congress in February 2016. In December, the Democrats held a hearing on the Investment chapter of the Trans-Pacific Partnership. In this episode, highlights from that hearing..."},{"slug":"CD-115","number":115,"published_at":1453033200000,"title":"Trans-Pacific Partnership (TPP): Access to Medicine","preview":"Need drugs? The Trans-Pacific Partnership is an international treaty that Congress needs to approve. In this episode, find out how the TPP would affect your access to medicine. Would this treaty provide you access to life-saving drugs or would it..."},{"slug":"CD-116","number":116,"published_at":1453636860000,"title":"Trans-Pacific Partnership (TPP) – Environment Chapter","preview":"In the third and final episode in our Trans-Pacific Partnership series, we take a look at the TPP Environment Chapter; would the treaty actually improve enforcement of environmental laws around the world?    Please support Congressional Dish:  ..."},{"slug":"CD-117","number":117,"published_at":1454244000000,"title":"Authorization for Limitless War","preview":"War ahead! While the country was busy preparing for a giant snowstorm, the leader of the Senate quietly made an Authorization for the Use of Military Force (AUMF) eligible for a vote in the Senate, fast tracking it through normal Senate process. In..."},{"slug":"CD-118","number":118,"published_at":1454869260000,"title":"How to Get Your Name on the Ballot","preview":"In this special episode, we take a look at the different rules for getting on the ballot for the House of Representatives in all fifty States, and take a look at how some States made it way too hard for Independents to qualify. Executive Producer:..."},{"slug":"CD-119","number":119,"published_at":1455453060000,"title":"Angel Watch Center","preview":"Good news! A new law was signed that creates the Angel Watch Center within the Department of Homeland Security, which will coordinate travel monitoring of convicted sex offenders. In this episode, Jen discusses the new law with Tim Ballard, the..."},{"slug":"CD-120","number":120,"published_at":1456727220000,"title":"Cybersecurity For Sale","preview":"CISA is law; all private companies have immunity for sharing data with the government for \"cybersecurity\", so what happens now? In this episode, we examine the plans being discussed and implemented by Congress to secure the data stored by the U.S...."},{"slug":"CD-121","number":121,"published_at":1457891340000,"title":"Legislative Sabotage","preview":"Stop the laws! In this episode, learn the details of three bills that passed the House of Representatives in January which would make enforcing laws more difficult for Federal agencies.  Please support Congressional Dish:   to contribute with PayPal..."},{"slug":"CD-122","number":122,"published_at":1459132440000,"title":"European Union Attacks","preview":"In the wake of the Brussels bombings, which attacked the heart of the European Union, we examine the history of the European Union and how this terrorist attack may affect its future.    Please support Congressional Dish:   to contribute with..."},{"slug":"CD-123","number":123,"published_at":1460318040000,"title":"Health or Profits","preview":"Health: Is there anything more important? In this episode, we examine three bills that moved through Congress in 2016 which would have a direct effect on the health of American citizens. Would the changes benefit you? . He will be forever loved and..."},{"slug":"CD-124","number":124,"published_at":1461534360000,"title":"The Costs of For-Profit War","preview":"Two defense contractors went on a podcast and everything they said was true. In this episode, discover the shocking extent to which our government has privatized wartime operations.    Please support Congressional Dish:   to contribute with..."},{"slug":"CD-125","number":125,"published_at":1462729860000,"title":"Un-Governing the Internet","preview":"The Internet is a powerful international communications tool; how does the 114th Congress plan to change how it's governed? In this episode, learn about the bills that are moving through Congress that could have a direct effect on the future of the..."},{"slug":"CD-126","number":126,"published_at":1464058500000,"title":"The Presidential Primary","preview":"Beware: Opinions ahead! In this special episode, Jen discusses who she will vote for in the June 7th Presidential Primary.    Please support Congressional Dish:   to contribute with PayPal or Bitcoin; click the PayPal \"Make it Monthly\" checkbox..."},{"slug":"CD-127","number":127,"published_at":1465751040000,"title":"The Fast Act (The Transportation Funding Law)","preview":"Transportation: We all need it, and Congress funded it. In this episode, we take a detailed look into the FAST Act, which funds our national transportation network for the next five years.  Please support Congressional Dish:   to contribute with..."},{"slug":"CD-128","number":128,"published_at":1466968500000,"title":"Crisis in Puerto Rico","preview":"Puerto Rico is in trouble and only the U.S. Congress can help the island of U.S. citizens. Does the bill quickly moving through Congress actually help Puerto Rico? Executive Producer: Kevin  Please support Congressional Dish:   to contribute with..."},{"slug":"CD-129","number":129,"published_at":1468196880000,"title":"The Impeachment of John Koskinen","preview":"Impeachment: A serious punishment for serious corruption. In this episode, learn why Congress has begun the process of impeaching IRS Commissioner John Koskinen and how his impeachment would prevent light from being shined upon dark money in politics...."},{"slug":"CD-130","number":130,"published_at":1469420880000,"title":"Netroots Nation","preview":"Netroots Nation is an annual political conference where \"progressive\" politicians, journalists, and activists gather to exchange ideas. In this episode, Jen highlights her experience at Netroots Nation 2016. Included are an update on the status of the..."},{"slug":"CD-131","number":131,"published_at":1471239540000,"title":"Bombing Libya","preview":"Congress goes on vacation; the Executive Branch escalates a war. In this episode, we look back at the 2011 Libya regime change to understand why we are bombing again in 2016. Executive Producer: Anonymous  Please support Congressional Dish:   to..."},{"slug":"CD-132","number":132,"published_at":1472417700000,"title":"Airplanes!","preview":"The Federal Aviation Administration performs the essential work of keeping airplanes from crashing into each other in the sky; in this episode, we take a look at the new law that temporarily funds the FAA and makes some important changes to aviation..."},{"slug":"CD-133","number":133,"published_at":1473655920000,"title":"The Electoral College","preview":"In a Presidential Election year when the Big Two Parties have selected widely disliked candidates, is it possible to vote None of the Above into the Presidency? In this episode, by learning how the electoral college works, we explore our options for..."},{"slug":"CD-134","number":134,"published_at":1474845780000,"title":"The EpiPen Hearing","preview":"Epinephrine injectors are life saving devices for people with food allergies and one company - Mylan Inc. - produces almost all of them. In this episode, listen to the highlights from a House Oversight and Government Reform Committee grilling of Mylan..."},{"slug":"CD-135","number":135,"published_at":1475445900000,"title":"Education is Big Business (Every Student Succeeds Act)","preview":"The Every Student Succeeds Act was signed into law at the end of 2015 and is a major overhaul of education policy in the United States. In this episode, find out how the new law will likely lead to a massive transfer of taxpayer money into private..."},{"slug":"CD-136","number":136,"published_at":1476681840000,"title":"Building WWIII","preview":"The deadline to fund the government has passed and only one section of the government was funded in full for 2017: Military Construction and the Veteran's Administration. In this episode, analyze the wisdom of the military construction projects that..."},{"slug":"CD-137","number":137,"published_at":1477899660000,"title":"Story of the 114th Congress","preview":"The 2016 Election is finally here; in this episode, we take a look at the job performance of our 114th Congress.  Please support Congressional Dish:   to contribute with PayPal or Bitcoin; click the PayPal \"Make it Monthly\" checkbox to create a..."},{"slug":"CD-138","number":138,"published_at":1479073860000,"title":"Election of President Trump","preview":"President Trump with a GOP Congress. The shock has not worn off. In this commentary-heavy episode, Jen shares some key moments from her Election Night experience, takes a close look at the incoming 115th Congress, and tries to process her thoughts on..."},{"slug":"CD-139","number":139,"published_at":1479647400000,"title":"Inside Congress","preview":"Chip Lake is a member of the Congressional Dish community and the former Chief of Staff to retiring Rep. Lynn Westmoreland of Georgia's 3rd district. In this enlightening episode, Chip provides valuable insight on how Congressional offices operate,..."},{"slug":"CD-140","number":140,"published_at":1481525640000,"title":"The War Mongers’ Plan","preview":"No one really knows what Donald Trump plans to do as US Commander in Chief, but the United States' most influential war mongers have a plan. In this episode, hear the highlights from a Senate Armed Services Committee hearing - a hearing that was kept..."},{"slug":"CD-141","number":141,"published_at":1482693360000,"title":"Terrorist Gifts & The Ministry of Propaganda (2017 NDAA)","preview":"The 2017 National Defense Authorization Act grants permission for next year's wars. In this episode, we look at how the new law, in partnership with a reckless Executive Order, will provide weapons to terrorists and legalize American wars fought with..."},{"slug":"CD-142","number":142,"published_at":1483899540000,"title":"Unethical Rules","preview":"The 115th Congress has begun! In this episode, we take a quick look at that government funding law that sets up an April funding crisis for this new Congress and we take a closer look at the shady new rules governing the 115th House of..."},{"slug":"CD-143","number":143,"published_at":1485143640000,"title":"Trump’s Law Enforcers","preview":"The Attorney General and the Secretary of the Department of Homeland Security are the most powerful domestic law enforcement officers in the United States government. In this episode, hear critical highlights from the confirmation hearings of..."},{"slug":"CD-144","number":144,"published_at":1486940640000,"title":"Trump’s War Manufacturers","preview":"Defense Secretary General James Mattis, Secretary of State Rex Tillerson, and CIA Director Mike Pompeo have been confirmed by the Senate and are now the most powerful influencers of foreign policy in the Trump Administration. In this episode, we..."},{"slug":"CD-145","number":145,"published_at":1488122340000,"title":"Price of Health Care","preview":"Former Congressman Tom Price is our new Secretary of Health and Human Services, making him the chief law enforcement officer of health care policy in the United States. In this episode, hear highlights from his Senate confirmation hearings as we..."},{"slug":"CD-146","number":146,"published_at":1489380840000,"title":"Repeal & Replace","preview":"“Repeal & Replace” is on the move! The American Health Care Act is the Republican plan to partially repeal the Affordable Care Act and it is quickly moving through Congress. In this episode, discover exactly what the bill would do if it were..."},{"slug":"CD-147","number":147,"published_at":1490998500000,"title":"Controlling Puerto Rico","preview":"What is Puerto Rico? Many Americans - if not most - are unaware that Puerto Rico is a part of the United States. In this episode, learn the history of our scandalous treatment of the US citizens living in Puerto Rico and explore how Puerto Rico’s..."},{"slug":"CD-148","number":148,"published_at":1491763500000,"title":"Trump’s First Laws","preview":"We have the first wave of the Trump laws! In this episode, highlights of the most impactful laws from the first three months of the 115th Congress, which include favors to the fossil fuel industry, gun industry, telecommunications industry, and..."},{"slug":"CD-149","number":149,"published_at":1493000100000,"title":"Fossil Fuel Foxes","preview":"Exxon Mobil’s CEO is now the Secretary of State. The Koch Brothers’ Congressman is the CIA Director. We’ve already seen signs that the Trump Administration and the fossil fuel industry are merging. In this episode, hear the highlights of the..."},{"slug":"CD-150","number":150,"published_at":1493990160000,"title":"Pivot to North Korea","preview":"Congress is back from vacation and instead of focusing their investigative power on Syria in the wake of President Trump’s first bombing of the Syrian government, Congress focused on North Korea. In this episode, get the background information you..."},{"slug":"CD-151","number":151,"published_at":1496002800000,"title":" AHCA – The House Version (American Health Care Act)","preview":"The American Health Care Act, the Republican plan for a new health care system, passed the House of Representatives at lightning speed. In this episode, get the backstory on the reckless process used to pass the bill, learn how it changed from the..."},{"slug":"CD-152","number":152,"published_at":1497207600000,"title":"Air Traffic Control Privatization","preview":"Air traffic controllers in the United States are a part of the Federal Aviation Administration (FAA) but Congress is seriously considering changing that. In this episode, we examine a plan being developed to transfer control of the nation’s air..."},{"slug":"CD-153","number":153,"published_at":1498427400000,"title":"Save the Post Office!","preview":"The post office is in trouble. Faced with an enormous debt and a legal obligation to serve every single American, the United States Postal Service needs Congress to make some changes in order to prevent service cuts and financial ruin. In this episode..."},{"slug":"CD-154","number":154,"published_at":1500875940000,"title":"The OTHER Health Care Bills","preview":"We've paid a lot of attention this year to the bill that would “Repeal and Replace” the Affordable Care Act but that is not the only bill related to health care that is moving through Congress. In this episode, learn about the other health care..."},{"slug":"CD-155","number":155,"published_at":1502071800000,"title":"FirstNet Empowers AT&T","preview":"In 2012, Congress created a new government agency called FirstNet and tasked it with building a high-speed wireless network that would allow all first responders in the United States to communicate with each other daily and in times of emergencies. In..."},{"slug":"CD-156","number":156,"published_at":1503294480000,"title":"Sanctions – Russia, North Korea & Iran","preview":"On August 2nd, President Trump signed a new law that passed Congress with the overwhelming support of both political parties, which imposes sanctions on three countries: Russia, North Korea, and Iran. In this episode, we examine the new sanctions and..."},{"slug":"CD-157","number":157,"published_at":1505103240000,"title":"Failure to Repeal","preview":"Process: It matters. During the first seven months of the 115th Congress, the Republicans tried - in multiple ways - to repeal portions of the Affordable Care Act. We already know what they were trying to do; in this episode, hear the full story of..."},{"slug":"CD-158","number":158,"published_at":1506173640000,"title":"Rapid DNA Act","preview":"Since 1994, the FBI has maintained a database with samples of DNA taken from convicted criminals in order to match those samples with DNA collected at crime scenes. However, over the course of the last two decades, the DNA database has expanded to..."},{"slug":"CD-159","number":159,"published_at":1508121540000,"title":"Crisis Management","preview":"Natural disasters: They just keep coming. In this episode, learn about the disaster relief bill that will soon be law, get an update from Puerto Rico from a member of the Coast Guard, and look into a few new laws that included disaster relief..."},{"slug":"CD-160","number":160,"published_at":1509341100000,"title":"Equifax Breach","preview":"If you are an American adult, there is a good chance that criminals now have the ability to match your name and social security number, greatly increasing your risk of becoming a victim of identity fraud. In this episode, hear highlights from..."},{"slug":"CD-161","number":161,"published_at":1510551180000,"title":"Veterans Choice Program","preview":"The Veterans Health Administration operates a taxpayer-funded health system to provide our nation’s veterans physical and mental health services. The Veterans Choice Program is a fundamental change to that system as it allows veterans to get..."},{"slug":"CD-162","number":162,"published_at":1511745300000,"title":"Dishing with Matt Marr","preview":"C-SPAN is much more fun with friends! In this special episode, Matt Marr, comedian and host of the Dear Mattie Show, joins Jen at The Comedy Store to discuss three bills that have passed the U.S. House of Representatives. Lots of laughs in this one! ..."},{"slug":"CD-163","number":163,"published_at":1512975267000,"title":"“Net Neutrality”","preview":"The Internet plays an essential role in our modern society and yet the way the Internet will be governed is still unclear. In anticipation of an impending Federal Communications Commission vote to reverse the so called “net neutrality” regulation impl"},{"slug":"CD-164","number":164,"published_at":1514043540000,"title":"Hope 2018 with Jessica Morse","preview":"We’re officially halfway through the 115th Congress and we will soon get our next chance to hire better representation in 2018. In this special episode, recorded in front of a live audience, meet Jen’s friend who is running for Congress."},{"slug":"CD-165","number":165,"published_at":1515813834000,"title":"Christmas Dingleberries","preview":"Right before Christmas, the government was temporarily funded for the fourth time this fiscal year, but this latest funding law came with a few surprises. In this episode, a feisty Jen outlines the law to expose a favor to the war industry,..."},{"slug":"CD-166","number":166,"published_at":1517082854000,"title":"I Spy a Shutdown","preview":"Register for   January 19th was a big day for the 115th Congress: Part of the government ran out of funding and some spying authorities also expired. In this episode, learn about FISA reauthorization law that contained a giant loophole that will allow..."},{"slug":"CD-167","number":167,"published_at":1518393409000,"title":"Combating Russia (NDAA 2018) LIVE","preview":"We’re doing it live! In this episode, recorded in front of a live audience at Podfest in Orlando, Florida, learn about the concerning permissions granted to the war departments in the 2018 National Defense Authorization Act which are designed to..."},{"slug":"CD-168","number":168,"published_at":1519527579000,"title":"Nuclear Desperation","preview":"Cold War: Part Duex In early February, Defense Secretary James Mattis and Vice Chair of the Joint Chiefs of Staff General Paul Selva testified to Congress about two recently released war strategy documents: The National Defense Strategy and the..."},{"slug":"CD-169","number":169,"published_at":1520703395000,"title":"Fiscal Recklessness","preview":"Another shutdown, another dingleberry-filled temporary funding law! In this episode, learn about the new law that reopened the government after the 6 hour shutdown by providing funding until March 23 and be one of the few people in the country who..."},{"slug":"CD-170","number":170,"published_at":1522005439000,"title":"Electrifying Puerto Rico","preview":"On September 20, 2017, Hurricane Maria wiped out the electricity on the entire island of Puerto Rico. Six months later the lights are still off for too many people. In this episode, by hearing highlights of Congressional testimony from Puerto Rico's..."},{"slug":"CD-171","number":171,"published_at":1523728811000,"title":"2,232 Pages","preview":"In a special crossover episode of The David Pakman Show on YouTube, hear the infuriating story of how the 2,232 page “omnibus” government funding bill became law , discover a provision snuck into law that further erodes privacy rights, learn why..."},{"slug":"CD-172","number":172,"published_at":1525064082000,"title":"The Illegal Bombing of Syria","preview":"On Friday the 13th of April, President Trump bombed the government of Syria… Again. In this episode, learn some of the little-discussed history of and reasons for the on-going attempts to overthrow the government of Syria.  Please Support..."},{"slug":"CD-173","number":173,"published_at":1526266076000,"title":"War & Prairie Chickens","preview":"The law that funded the government for 2018 is 2,232 pages and Jen has finished reading a quarter of it. In this episode, learn about the most interesting provisions she found in the Department of Defense and environmental sections of the quickly..."},{"slug":"CD-174","number":174,"published_at":1527487114000,"title":"Bank Lobbyist Act","preview":"The Bank Lobbyist Act was just signed into law and as the nickname suggests, it is a banker’s wet dream. In this episode, learn the details of this new law including the many favors to banks big and small - which undoubtedly make our entire..."},{"slug":"CD-175","number":175,"published_at":1528702224000,"title":"State of War","preview":"The State Department is known as the agency that solves conflicts with words but a closer look reveals that it’s much more connected to war than most of us think. By examining the State Department’s funding for 2018, discover the State..."},{"slug":"CD-176","number":176,"published_at":1529893441000,"title":"Target Venezuela: Regime Change in Progress","preview":"Venezuela, home to the world’s largest oil reserves, is a country that has been experimenting with a new so-called “socialist” economic model for twenty years. For this sin, two consecutive Venezuelan Presidents have been targeted for regime..."},{"slug":"CD-177","number":177,"published_at":1531092674000,"title":"Immigrant Family Separations","preview":"A new policy change by the Trump administration on May 7th has resulted in thousands of children being separated from their want-to-be-immigrant parents who crossed the U.S. southern border in the wrong location. In this episode, hear from officials..."},{"slug":"CD-178","number":178,"published_at":1533101160000,"title":"Election Insecurity","preview":"Since the 2016 election, our country has been questioning whether our elections are secure, fair, and accurate. In this episode, we examine the threats to our election administration, both real and overblown.  Please Support Congressional Dish - Quick..."},{"slug":"CD-179","number":179,"published_at":1535341515000,"title":"Hearing: Who's Tracking the Immigrant Kids?","preview":"In an experimental follow-up episode, listen along with Jen and Joe to the highlights of a Senate hearing examining the progress that has been made towards caring for the immigrant children who have been either taken from their immigrant parents or..."},{"slug":"CD-180","number":180,"published_at":1536606951000,"title":"How Congress Spent Your Taxes in 2018","preview":"Every year, the President submits a budget request to Congress, but how much attention does Congress pay to those requests? In this episode, we compare the Trump administration requests to the amounts actually provided by Congress for fiscal year..."},{"slug":"CD-181","number":181,"published_at":1538247596000,"title":"Midterm Election Study Guide","preview":"Our duty as voters is to judge the job performance of our members of Congress and decide whether or not they deserve to be re-hired or fired from their positions as lawmakers. In this episode, Jen summarizes 20 controversial bills and laws that passed..."},{"slug":"CD-182","number":182,"published_at":1539571436000,"title":"Justice Kavanaugh","preview":"It's done. Brett Kavanaugh is a Supreme Court Justice. Most of the media coverage of his confirmation centered on the sexual assault allegations made by Dr. Christine Blasey Ford but that's only one part of the story. In this episode, learn about the..."},{"slug":"CD-183","number":183,"published_at":1540785123000,"title":"Tax Cuts... For Some of US","preview":"Taxes: We all hate them but we all have to pay them. In December 2017, the Republicans in Congress rushed major changes to our tax policy into law. In this episode, host Jen Briney and her accountant friend, Alexis Claypool, explain the most..."},{"slug":"CD-184","number":184,"published_at":1542144441000,"title":"Midterm Election","preview":"Divided government! The 2018 midterm elections are over and we know what the 116th Congress is going to look like: The Republican Party will continue to control the Senate and the Democratic Party will control the House of Representatives. In this..."},{"slug":"CD-185","number":185,"published_at":1543200853000,"title":"Global Energy Outlook","preview":"It’s impossible to analyze the political calculations of world leaders without factoring in global energy. In this episode, listen along with Jen and Joe Briney as they listen to a U.S. Senate Committee on Energy and Natural Resources hearing..."},{"slug":"CD-186","number":186,"published_at":1544472178000,"title":"National Endowment for Democracy","preview":"The National Endowment for Democracy is a private foundation - that receives millions of our tax dollars - that pays groups to work to change the governments of other countries. In this episode, hear highlights from a hearing during which the..."},{"slug":"CD-187","number":187,"published_at":1545601979000,"title":"Combating China","preview":"People in power tell us constantly that China is a threat but... Why? In this episode, we explore the big picture reasons why China poses a threat to those in power in the United States and what our Congress is doing to combat that threat. Spoiler..."},{"slug":"CD-188","number":188,"published_at":1547488215000,"title":"Welcome to the 116th Congress","preview":"We've transitioned! The 115th Congress is finally over and the 116th has begun. In this episode, get the details on the last acts of the 115th Congress, including the play by play of the shutdown drama, and learn about the new rules written by..."},{"slug":"CD-189","number":189,"published_at":1548642160000,"title":"\"First Step\" Prison Reform","preview":"In the final days of the 115th Congress, Congress passed and President Trump signed into law the First Step Act, which made changes to the operation of the federal prison system. In this episode, learn every detail of this new law, including the big..."},{"slug":"CD-190","number":190,"published_at":1549859654000,"title":"A Coup for Capitalism","preview":"We knew it was coming, and now it's here: A coup is in progress in Venezuela. In this follow up episode to CD176 (Target Venezuela: Regime Change in Progress), learn additional backstory and details about the recent events in Venezuela, including the..."},{"slug":"CD-191","number":191,"published_at":1550947307000,"title":"The “Democracies” Of Elliott Abrams","preview":"Elliott Abrams, the new U.S. Special Envoy to Venezuela, along with witnesses from the State Department and USAID, testified to Congress about the Trump administration's efforts to replace Venezuela's President. In this episode, hear highlights from..."},{"slug":"CD-192","number":192,"published_at":1552616244000,"title":"Democracy Upgrade Stalled","preview":"Things often don’t go according to plan. In this episode, featuring a feverish and frustrated Jen Briney, learn about the shamefully rushed process employed by the Democrats to pass their top priority bill, H.R. 1, through the House of..."},{"slug":"CD-193","number":193,"published_at":1554063401000,"title":"How to Prevent Death by Chemical Explosion (CFATS)","preview":"Chemical storage facilities exist all over the country and one of them recently caught fire, poisoning the residents Houston, Texas for three days. In this episode, learn about a Department of Homeland Security program - the CFATS program- designed to..."},{"slug":"CD-194","number":194,"published_at":1555298821000,"title":"Measles Outbreak","preview":"Measles is back in the United States and is currently spreading quickly; the number of cases in the United States in 2019 has already surpassed the number of cases in all of last year. In this episode, get highlights from two Congressional hearings..."},{"slug":"CD-195","number":195,"published_at":1556513797000,"title":"Yemen","preview":"Yemen: Most of us don't know where that is but we Americans have been participating in a war there since 2015. In a surprise move, the 116th Congress recently put a resolution on President Trump's desk that would LIMIT our participation in that war...."},{"slug":"CD-196","number":196,"published_at":1558290775000,"title":"The Mueller Report","preview":"We finally have the facts. The two year long investigation, lead by Robert Mueller, into whether or not the 2016 Donald Trump for President campaign worked with members of the Russian government to steal and release Democratic Party emails is now..."},{"slug":"CD-197","number":197,"published_at":1559325954000,"title":"Constitutional Crisis","preview":"The United States system of government depends on the Legislative, Executive, and Judicial branches keeping each other accountable, but what happens when two of the branches refuse to police the third? We might soon find out. In this episode, by..."},{"slug":"CD-198","number":198,"published_at":1560746009000,"title":"Rationing the 9/11 Victim Compensation Fund","preview":"The 9/11 Victim Compensation Fund is being rationed due to a lack of funding and an approaching end date for the program. In this episode, learn about the shocking, growing number of 9/11 victims, understand why these victims are in danger of having..."},{"slug":"CD-199","number":199,"published_at":1561926028000,"title":"Surprise Medical Bills","preview":"Almost 40% of Americans WITH health insurance reported they had received a surprise medical bill in the past year from a doctor or hospital for a service they thought was covered by their insurance plan. Why is this happening? And what can we do about..."},{"slug":"CD-200","number":200,"published_at":1563136885000,"title":"How to End Legal Bribes","preview":"The currently legal ability of obscenely rich people to bribe lawmakers and law enforcers is the source of many - if not all - of our political problems. In this episode, get an update on the few democracy-enhancing bills that have moved in this..."},{"slug":"CD-201","number":201,"published_at":1569269543000,"title":"WTF is the Federal Reserve?","preview":"The Federal Reserve system: Most Americans know it's important but most Americans don't know exactly what it is. In this episode, discover the controversial and disturbing history of the Federal Reserve and learn how it has allowed bankers and..."},{"slug":"CD-202","number":202,"published_at":1570393099000,"title":"Impeachment?","preview":"Donald Trump. Ukraine. Joe Biden. A phone call. Election Interference. Impeachment! What the hell is going on? In this episode, an irritated Jen gives you the backstory that you need to know about the impeachment drama, including what the steps to..."},{"slug":"CD-203","number":203,"published_at":1572545999000,"title":"Scattering Interior","preview":"Public land belongs to all Americans and the bureaus of the Interior Department are responsible for balancing conservation and resource extraction on our land. The Trump administration is making some major changes to this important agency which few..."},{"slug":"CD-204","number":204,"published_at":1573584269000,"title":"Why Brexit the EU?","preview":"The European Union is a partnership of 28 countries that the United Kingdom has been trying to escape from since 2016. In this episode, we examine the European Union in order to understand the decision the citizens of the UK were asked to make and..."},{"slug":"CD-205","number":205,"published_at":1574656534000,"title":"Nuclear Waste Storage","preview":"For 38 years, the United States government has been trying to figure out what to do with the radioactive nuclear waste that was created when the Defense Department developed nuclear weapons and the nuclear waste that continues to be created by nuclear..."},{"slug":"CD-206","number":206,"published_at":1577137883000,"title":"Impeachment: The Evidence","preview":"President Donald Trump has been impeached. In this episode, hear the key evidence against him presented by the witnesses called to testify in over 40 hours of hearings that took place in the \"inquiry\" phase of the impeachment. Using this episode, you..."},{"slug":"CD-207","number":207,"published_at":1578886507000,"title":"State of Corporatism","preview":"It's 2020 and the government was actually funded before the new year! However, as always, dozens of bills hitched a ride into law attached to the government funding. In this episode, learn about some of the dingleberry laws that could effect your..."},{"slug":"CD-208","number":208,"published_at":1581281318000,"title":"The Brink of the Iran War","preview":"2020 began with a bombing in Iraq - ordered by President Trump - which killed one of Iran's highest ranking military officers. In this episode, we take a close look at the recent history of our relationship with the Iranian government in order to..."},{"slug":"CD-209","number":209,"published_at":1582476930000,"title":"USMCA with Lori Wallach","preview":"The Trump administration renegotiated NAFTA and the 116th Congress passed those changes in order to make the USMCA into law. In this episode, international trade expert Lori Wallach, the Director of Public Citizen's Global Trade Watch, joins Jen to..."},{"slug":"CD-210","number":210,"published_at":1583666278000,"title":"The Afghanistan War","preview":"The Trump administration has made a deal with the Taliban which has been reported as \"the beginning of the end\" of the Afghanistan war... But is it? In this episode, an examination of Afghanistan's past helps us understand our current role in..."},{"slug":"CD-211","number":211,"published_at":1584770486000,"title":"Coronavirus (COVID-19)","preview":"Coronavirus. A lot of people are scared - and money is being made off of our fear. In this episode, let's take a calm look at the facts presented under oath by health professionals in Congress and in official press conferences. What is happening? How..."},{"slug":"CD-212","number":212,"published_at":1586147703000,"title":"The COVID-19 Response Laws","preview":"Since COVID-19 began ravaging the human race, Congress has passed three bills into law that are meant to respond to both the health care crisis and the financial crisis. In this episode, Jen highlights the first two laws in their entirety and the..."},{"slug":"CD-213","number":213,"published_at":1588011012000,"title":"CARES Act - The Trillions for COVID-19 Law","preview":"The U.S. Treasury has been legally robbed! In this episode, discover the secret provisions in the multi-trillion dollar CARES Act that no one is talking about (like the new process for over the counter drug approvals) and discover the reasons behind..."},{"slug":"CD-214","number":214,"published_at":1589737233000,"title":"Facial Recognition","preview":"Over the last year, various Congressional committees have been investigating the expanding use of facial recognition technology by law enforcement and the private sector. In this episode, hear the highlights of these investigations which will..."},{"slug":"CD-215","number":215,"published_at":1590972831000,"title":"COVID-19 Testimony","preview":"When Congress (finally) returned from their COVIDcation, experts in medicine, vaccine development, law, and business testified under oath. In this episode, hear the highlights from 17 hours of that expert testimony during which you'll learn about a..."},{"slug":"CD-216","number":216,"published_at":1592153031000,"title":"Dingleberries Against Police Brutality","preview":"In response to the horrific murder of George Floyd and the worldwide protests against police brutality that followed, the House Democrats wrote the Justice in Policing Act. The provisions in this bill are our best chance for real change in the 116th..."},{"slug":"CD-217","number":217,"published_at":1594613826000,"title":"Proxy Voting","preview":"The House of Representatives is now allowing absent members to vote via members who are physically present on the House floor, in a process called proxy voting, for the first time in US History. In this episode, we examine the unnecessary,..."},{"slug":"CD-218","number":218,"published_at":1596212293000,"title":"Minerals are the New Oil","preview":"Rare earth minerals are essential ingredients for many of the technologies that are important today and will be key in the future. In this episode, we learn about a new global economy being created around rare minerals and how the United States can..."},{"slug":"CD-219","number":219,"published_at":1597603301000,"title":"Oversights of CARES","preview":"COVID still rages, CARES Act provisions have expired, and Congress is on another vacation. In this episode, by piecing together information discovered in six CARES Act oversight hearings, find out what problems weren’t solved by the CARES Act, what..."},{"slug":"CD-220","number":220,"published_at":1599498198000,"title":"Postal Service Sabotage","preview":"The mail has been slow this summer, no doubt about it, but did the Trump administration slow the mail down on purpose in order to interfere with mail-in voting? In this episode, listen to highlights of recent emergency Congressional hearings in order..."},{"slug":"CD-221","number":221,"published_at":1602479042000,"title":"Kicking the Funding Can","preview":"Surprise, surprise! Congress failed to fund the government on time again. In this episode, discover the hidden secrets in the bill that temporarily funds the government and the politics behind the dingleberries that hitched a ride into law. Executive..."},{"slug":"CD-222","number":222,"published_at":1604163604000,"title":"116th Congress Performance Review","preview":"In the last episode before the 2020 election, let's take a comprehensive look at what went on in the 116th Congress, a divided Congress during which the House of Representatives was controlled for the first time since Congressional Dish began by the..."},{"slug":"CD-223","number":223,"published_at":1605459490000,"title":"Election 2020: The Empire Returns","preview":"The election is... Actually not quite over but we have to record this episode sometime. In this episode, a breakdown of the notable winners and losers. Did we fire them all? Or... Any of them?  Executive Producer: Ronda Kisner  Please Support..."},{"slug":"CD-224","number":224,"published_at":1606699151000,"title":"Social Media Censorship","preview":"Everyone who uses Facebook, Google, and Twitter has probably noticed the disappearance of posts and the appearance of labels, especially during the 2020 election season. In this episode, hear the highlights from six recent House and Senate hearings..."},{"slug":"CD-225","number":225,"published_at":1608525237000,"title":"Targets of the Free Marketeers","preview":"While the focus of the world has been on the COVID-19 pandemic, Congress has been busy preparing a war authorization for the incoming Joe Biden administration. In this episode, we examine the advice given to Congress in nine recent hearings to learn..."},{"slug":"CD-226","number":226,"published_at":1611595359000,"title":"The 116th Lame Duck","preview":"We just lived through the craziest lame duck period - the time between when the President and members of Congress keep their power after being fired in an election - in United States history. In this episode, we look at everything that happened, from..."},{"slug":"CD-227","number":227,"published_at":1613358606000,"title":"Coronabus Health Care","preview":"The 116th Congress finished their reign by passing every section of government funding into law with COVID relief attached. In this episode, learn about the new COVID relief law after you hear about a surprise dingleberry that promises to end surprise..."},{"slug":"CD-228","number":228,"published_at":1614554642000,"title":"The Second Impeachment Trial of Donald Trump","preview":"Donald Trump was acquitted of \"Incitement of Insurrection\" at the end of his second impeachment trial. Many seem to think this result was inevitable, but that wasn't the case. In this episode, by examining the evidence and how it was presented by the..."},{"slug":"CD-229","number":229,"published_at":1615779177000,"title":"Target Belarus","preview":"We are in the process of regime changing Belarus. In this episode, I prove it. Executive Producer: Nich Secord  Please Support Congressional Dish – Quick Links   to contribute monthly or a lump sum via   to support Congressional Dish via Patreon..."},{"slug":"CD-230","number":230,"published_at":1618192684000,"title":"Pacific Deterrence Initiative","preview":"The 2021 National Defense Authorization Act (NDAA) and the Coronabus both enacted laws aiming to stop China from advancing their Belt and Road economic system that may soon be able to compete with the \"rules based international order\", which the..."},{"slug":"CD-231","number":231,"published_at":1619460721000,"title":"Lights Out: What Happened in Texas?","preview":"In mid-February 2021, a not-as-rare-as-it-used-to-be winter storm swept across the country, causing massive power outages in the state of Texas with deadly consequences. In this episode, hear the highlights of the congressional investigation into the..."},{"slug":"CD-232","number":232,"published_at":1622085939000,"title":"American Rescue Plan","preview":"In March 2021, a year after the official beginning of the COVID-19 pandemic, the fully Democratic Party controlled Congress sent President Joe Biden their version of a COVID relief bill to sign, a bill that was rejected by the entire Republican Party...."},{"slug":"CD-233","number":233,"published_at":1623646210000,"title":"Long COVID","preview":"\"Long COVID\" is the name for the phenomenon experienced by people who have \"recovered\" from COVID-19 but are still suffering from symptoms months after the virus invaded their bodies. In this episode, listen to highlights from a 7 hour hearing in..."},{"slug":"CD-234","number":234,"published_at":1624822989000,"title":"AWOL Recall: The Rock and Play Sleeper","preview":"In 2009, Mattel's Fisher-Price started selling the Rock and Play Sleeper, a recklessly designed baby bed. During the ten years that it was sold to parents around the world, dozens of babies died and thousands were injured due to the design of the Rock..."},{"slug":"CD-235","number":235,"published_at":1626039235000,"title":"The Safe Haven of Sanctions Evaders","preview":"Sanctions are weapons of economic war. In this episode, learn the troubling history of ever-expanding sanctions powers granted to the President designed to allow him to cut off people, companies, and governments from our financial system. You'll also..."},{"slug":"CD-236","number":236,"published_at":1627279367000,"title":"January 6: The Capitol Riot","preview":"Congress has conducted at least eleven bipartisan hearings to investigate the security failures that permitted a mob of American citizens to riot inside the Capitol Building and successfully disrupt Congress while they certified the 2020 election..."},{"slug":"CD-237","number":237,"published_at":1630300143000,"title":"Hunting Domestic Terrorists","preview":"In the aftermath of January 6th, Congress passed a \"Capitol Security\" law and is considering other measures to deal with \"domestic terrorists\". In this episode, after we examine the new law, we take a look at the domestic terrorism related bills..."},{"slug":"CD-238","number":238,"published_at":1631499084000,"title":"Losing Afghanistan","preview":"The war in Afghanistan is over. In this episode, we document how and why the Biden administration finally admitted defeat in our 20 year attempt to create a new government in Afghanistan and we take a hard look at the lessons we need to learn...."},{"slug":"CD-239","number":239,"published_at":1632709122000,"title":"The Enablers of Larry Nassar","preview":"In June 2015, the FBI in Indianapolis was notified that Larry Nassar, a doctor for Olympic caliber gymnasts, was sexually abusing his underage patients. In this episode, hear highlights from a riveting Senate hearing with testimony from Maggie..."},{"slug":"CD-240","number":240,"published_at":1633927281000,"title":"BIF The Infrastructure BILL","preview":"Jen has been all over the internet lately telling the world that the Bipartisan Infrastructure Framework is a dumpster fire of a bill. In this episode, she backs that up by comparing the levels of investment for different kinds of infrastructure and..."},{"slug":"CD-241","number":241,"published_at":1635121389000,"title":"20th Anniversary of the Patriot Act","preview":"The Patriot Act: A law that is still governing us after 20 years despite being almost universally hated. In this episode, we take a close look at the lesser known parts of the Patriot Act that became permanent immediately, examine the status of the..."},{"slug":"CD-242","number":242,"published_at":1636947141000,"title":"The Offshore Drilling Police","preview":"On October 1, 2021 an oil pipeline that was likely struck by a cargo ship's anchor leaked tens of thousands of gallons of oil into the ocean and onto the beaches of Orange County, CA. In this episode, examine how the oil spill happened by listening to..."},{"slug":"CD-243","number":243,"published_at":1638754458000,"title":"Target Nicaragua","preview":"In mid-November, following the re-election of Nicaraguan President Daniel Ortega, Congress passed and President Biden signed the RENACER Act, which escalated an ongoing economic war against President Daniel Ortega. In this episode learn about what the..."},{"slug":"CD-244","number":244,"published_at":1639979519000,"title":"Keeping Ukraine","preview":"Since the beginning of December, news outlets around the world have been covering a possible Russian invasion of Ukraine. In this episode, get the full back story on the civil war that has been raging in Ukraine since 2014, learn what role our..."},{"slug":"CD-245","number":245,"published_at":1642373072000,"title":"New Year, Same Congress","preview":"Much media attention has been rightfully aimed at the recent failures of Congress, but there was, in fact, lawmaking happening at the end of 2021. In this episode, learn about some laws that didn't get much attention, including a law that solves a..."},{"slug":"CD-246","number":246,"published_at":1643575522000,"title":"BIF: Appalachian Chemical Storage","preview":"The Infrastructure Law that was signed in late 2021 funds the first phase of a huge infrastructure project called the Appalachian Storage Hub, which would consist of large gas processing plants, underground chemical storage facilities, and pipeline..."},{"slug":"CD-247","number":247,"published_at":1644785549000,"title":"BIF: The Growth of US Railroads","preview":"The infrastructure law provides the most significant investment in passenger rail in U.S. history, but substantial hurdles - including a powerful cartel - stand firmly in the way of a real national network. In this episode, learn the ways the..."},{"slug":"CD-248","number":248,"published_at":1645995922000,"title":"Understanding the Enemy","preview":"Russian President Vladimir Putin has launched an illegal, unjustified war against Ukraine and Putin himself is the only person who can stop the war immediately. In this episode, we seek to understand why President Putin has launched this horrific war..."},{"slug":"CD-249","number":249,"published_at":1647808655000,"title":"A Few Good Laws","preview":"We have some new laws! In this episode, a brief overview of the government funding law that (finally) funds the government for 2022 and provides money and weapons to Ukraine, a new law that protects drinking water, a new law that slightly reduces the..."},{"slug":"CD-250","number":250,"published_at":1650827562000,"title":"Congress Saves the Postal Service","preview":"Congress did a good thing! In this encouraging episode, learn about a new law that saved the Postal Service from financial doom without spending one extra penny in taxpayer money. Then, listen to the highlights from a recent hearing about the..."},{"slug":"CD-251","number":251,"published_at":1652030825000,"title":"BIF: Driving Dangers Sustained","preview":"The recently signed infrastructure law continues the United States’ over-reliance on the most dangerous way to travel: driving a vehicle. Did Congress make sufficient safety improvements to decrease the dangers posed by driving in the United States?..."},{"slug":"CD-252","number":252,"published_at":1653235756000,"title":"Women’s Health Protection Act","preview":"The Women’s Health Protection Act is a bill written by Democrats that would guarantee access to abortion services in the United States. While this bill is unlikely to become law, learning what exactly the Democrats are proposing is instructive, as..."},{"slug":"CD-253","number":253,"published_at":1654477250000,"title":"Escalation of War","preview":"Since the Russian invasion of Ukraine began, Congress has signed four laws that send enormous amounts of money and weapons to Ukraine, attempting to punish Russia for President Putin’s invasion. In this episode, we examine these laws to find out..."},{"slug":"CD-254","number":254,"published_at":1656270041000,"title":"Baby Formula Shortage","preview":"After multiple formula-related infant deaths were reported to the FDA in February, samples from Abbott Laboratories' Sturgis, Michigan baby formula production facility tested positive for cronobacter, triggering a recall and a subsequent formula..."},{"slug":"CD-255","number":255,"published_at":1658092475000,"title":"Pharmacy Benefit Managers (PBMs)","preview":"The recently signed gun law, S. 2938: Bipartisan Safer Communities Act, contained a surprise dingleberry postponing a regulation designed to save seniors money on their pharmaceutical drugs by prohibiting kickbacks to an industry few have heard of:..."},{"slug":"CD-256","number":256,"published_at":1659216309000,"title":"Poisonous Pet Collars","preview":"Seresto Flea and Tick Collars for dogs and cats have been sold to Americans since 2013. During that time, the EPA has received approximately 100,000 reports of illnesses and 2,500 reports of deaths of animals that wore a Seresto Flea and Tick collar,..."},{"slug":"CD-257","number":257,"published_at":1661116593000,"title":"PACT Act - Health Care for Poisoned Veterans","preview":"After decades of our government denying healthcare to veterans they exposed to poisonous toxins, the PACT Act - which will eventually provide this hard-fought-for care - is now law. In this episode, learn exactly who qualifies for these new benefits..."},{"slug":"CD-258","number":258,"published_at":1663531884000,"title":"Gain of Function Research","preview":"On August 3rd, Senate Republicans held a hearing examining gain of function research: its possible role in creating the COVID-19 pandemic; the problems with oversight of this dangerous research; and recommendations to Congress for how to fix those..."},{"slug":"CD-259","number":259,"published_at":1663974812000,"title":"CHIPS: A State Subsidization of Industry","preview":"A new law, known as the CHIPS Act, provides over $50 billion to existing, profitable companies to fund new semiconductor production facilities in the United States. In this episode, we examine why Congress decided to gift these companies our tax money..."},{"slug":"CD-260","number":260,"published_at":1665367446000,"title":"Failure to Fund with Graham Elwood","preview":"Congress has failed to fund the government on time again. In this episode, Graham Elwood joins Jen as she geeks out on all the dingleberries attached to the new law extending Congress’s funding deadline until December 16th.  Please Support..."},{"slug":"CD-261","number":261,"published_at":1667149873000,"title":"Inflation Reduction Act","preview":"The Inflation Reduction Act is a new law designed to hasten the United States’ energy transition (and do nothing about inflation). In the last episode before the midterm election, learn about the energy path the Democratic Party has plotted for us..."},{"slug":"CD-262","number":262,"published_at":1668287372000,"title":"Inside C-SPAN with Howard Mortman","preview":"As we wait for the final results of the midterm elections to determine which party will control the House, enjoy Jen's interview with C-SPAN Communications Director, Howard Mortman. Jen and Howard discuss all things C-SPAN, including what C-SPAN crews..."},{"slug":"CD-263","number":263,"published_at":1669672629000,"title":"Republicans Take the House","preview":"The results are in: The Democrats will keep the Senate, the Republican will take the House. In this episode, in preparation for the 118th Congress, Jen analyzes the detailed policy documents released by the House Republicans to see what they could..."},{"slug":"CD-264","number":264,"published_at":1670782448000,"title":"Cryptocurrencies and Blockchain","preview":"FTX, a large cryptocurrency exchange, recently went bankrupt, leading to calls for government regulation of cryptocurrencies. But you might be wondering, what are cryptocurrencies? In part one of this two-part series, listen to expert testimony..."},{"slug":"CD-265","number":265,"published_at":1671821867000,"title":"Policing FTX","preview":"FTX, at one point the world’s third largest cryptocurrency exchange, went bankrupt, causing the entire cryptocurrency industry to crash. In this episode, hear highlights from Congressional testimony that will explain how FTX was able to grow so..."},{"slug":"CD-266","number":266,"published_at":1673028837000,"title":"Contriving January 6th","preview":"The January 6th Committee investigation is over and four criminal charges against former President Donald Trump have been referred to the Justice Department by the Committee. In this episode, hear a summary of 23 hours of testimony and evidence..."},{"slug":"CD-267","number":267,"published_at":1675020827000,"title":"The Monopoly Powers of Live Nation/Ticketmaster","preview":"Live Nation and Ticketmaster merged over a decade ago and Congress is concerned - for good reason - that the company is exerting monopoly powers over the live event industry. In this episode, learn how the merger was allowed to happen in the first..."},{"slug":"CD-268","number":268,"published_at":1676188860000,"title":"Disappearing Oversight: The NFL Sexual Misconduct Investigation","preview":"In December, the House Oversight and Reform Committee released a final report from their investigation into allegations of sexual assault committed by Washington Commanders team owner Dan Snyder. In this episode, you will hear the testimony and..."},{"slug":"CD-269","number":269,"published_at":1677431249000,"title":"NDAA 2023/Plan Ecuador","preview":"The annual war authorization (NDAA) is an excellent opportunity to examine our military’s roles and goals in the world. In this episode, learn about how much of our tax money Congress provided the Defense Department, including how much of that money..."},{"slug":"CD-270","number":270,"published_at":1679881693000,"title":"The Twitter Files","preview":"The First Amendment prohibits the U.S. government from censoring speech. In this episode, drawing from internal Twitter documents known as “the Twitter files” and Congressional testimony from tech executives, former Twitter employees, and..."},{"slug":"CD-271","number":271,"published_at":1681018246000,"title":"RESTRICTing TikTok","preview":"TikTok might be banned from the United States. In this episode, hear testimony from TikTok’s CEO and judge for yourself if you think the arrangement that TikTok has negotiated with the U.S. government is enough to ensure that the Chinese government..."},{"slug":"CD-272","number":272,"published_at":1682881200000,"title":"What is Taiwan?","preview":"Taiwan’s status in the world has never been clear and neither has the United States’ position on the issue. In this Congressional Dish, via footage from the C-SPAN archive dating back into the 1960s, we examine the history of Taiwan since World..."},{"slug":"CD-273","number":273,"published_at":1684041934000,"title":"Inside Congressional Committees with Dr. Maya Kornberg","preview":"For this episode, Jen sat down for an interview with fellow Congress nerd Dr. Maya Kornberg. Dr. Kornberg is a Research Fellow for the Brennan Center for Justice's Elections and Government Program and author of Inside Congressional Committees:..."},{"slug":"CD-274","number":274,"published_at":1685298988000,"title":"Norfolk Southern Train Derailment in East Palestine","preview":"On February 3rd, a train carrying 20 cars with poisonous, flammable chemicals derailed in East Palestine, OH. In this episode, we’re going to get some answers. Using testimony from four Congressional hearings, community meeting footage, National..."},{"slug":"CD-275","number":275,"published_at":1686537699000,"title":"Debt Ceiling 2023: Crisis Normalized","preview":"Another unnecessary crisis averted. In this episode, Jen examines the debt ceiling crisis events of the past to show that the Fiscal Responsibility Act of 2023 - which raised the debt ceiling - is not likely to reduce our government’s debt but will..."},{"slug":"CD-276","number":276,"published_at":1687746787000,"title":"The Demise of Dollar Dominance","preview":"The U.S. dollar’s status as the global reserve currency is diminishing, which reduces the power that U.S. leaders have over the global economic system. In this episode, hear highlights from recent Congressional testimony during which financial..."},{"slug":"CD-277","number":277,"published_at":1689445973000,"title":"PGA LIVs","preview":"The Chief Operating Officer and a board member of the PGA golf tour recently testified to the Senate as part of its investigation into the possible merger between the PGA and LIV golf tours. In this episode, hear a summary of their testimony which was..."},{"slug":"CD-278","number":278,"published_at":1690738702000,"title":"All Three UAP Hearings","preview":"Since May 2022, Congress has held three hearings looking into Unidentified Aerial Phenomena and the possibility of non-human intelligent life flying aircraft on Earth. In this episode, hear testimony from three Defense Department officials and three..."},{"slug":"CD-279","number":279,"published_at":1691954250000,"title":"The Censure of Adam Schiff","preview":"On June 21st, the House of Representatives censured Rep. Adam Schiff of California. The House has censured members just 24 times in our nation’s history, making Schiff the 25th. In this episode, we'll detail the actions outlined in the censure and..."},{"slug":"CD-280","number":280,"published_at":1693800307000,"title":"Corporate Junk Fees","preview":"Do you hate hidden hotel, housing, airline, ticketing, banking, and other corporate fees? Do you want Congress to do something about them? In this episode, learn about the wide range of unreasonable fees being reported to Congress during hearings and..."},{"slug":"CD-281","number":281,"published_at":1694999856000,"title":"Private Policing of the Organ Transplant Network","preview":"The system for coordinating organ donations and transplants in the United States is broken, according to experts who have testified over the course of many years to Congress. In this episode, hear their testimony about what is wrong with the current..."},{"slug":"CD-282","number":282,"published_at":1696818585000,"title":"Chaos Fires McCarthy","preview":"For the first time in U.S. history, the Speaker of the House of Representatives has been fired from the job mid-term. This episode is a play by play of the drama that lead up to this historic event, including the passing of a temporary government..."},{"slug":"CD-283","number":283,"published_at":1698034831000,"title":"A Federal Reserve Digital Dollar (CBDC)","preview":"The House Financial Services Committee has been investigating the possibility of the Federal Reserve creating a Central Bank Digital Currency. In this episode, hear experts unpack the nuances and implications of this idea during three hearings, and..."},{"slug":"CD-284","number":284,"published_at":1699199897000,"title":"Thieving Russia","preview":"While the world is distracted, members of Congress are writing bills designed to steal Russia’s money and give it to Ukraine. In this episode, listen to the pitch being made to Congress as we examine if this is a good idea. Please Support..."},{"slug":"CD-285","number":285,"published_at":1700502623000,"title":"The Indicteds: Rep. George Santos and Sen. Robert Menendez","preview":"Two members of Congress, one from each side of the aisle and each branch of Congress, are currently under criminal indictment, yet are steadfastly clinging to their roles as lawmakers. In this episode, we’ve got the dirt straight from the criminal..."},{"slug":"CD-286","number":286,"published_at":1702772445000,"title":"Prolonging the War in Ukraine","preview":"Congress is probably going to send approximately $50 billion more, most of that for weapons, to continue the war in Ukraine. In November, high ranking officials from the State Department testified about how the Biden administration intends to use our..."},{"slug":"CD-287","number":287,"published_at":1709171008000,"title":"War Money","preview":"It’s been four months since President Biden requested over $100 billion in war money for Israel and Ukraine and the Senate has now passed a bill that would provide most of the money. In this episode, we examine the events that lead up to and have..."},{"slug":"CD-288","number":288,"published_at":1709755578000,"title":"Government Funding 101","preview":"As we enter another round of government funding drama, let’s learn the basics. In this episode, we examine how the process is supposed to work, spot the tell tale signs that something has gone wrong, and decipher all of the DC wonky words that make..."},{"slug":"CD-289","number":289,"published_at":1710465494000,"title":"The Not A TikTok Ban Bill","preview":"A bill is quickly moving through Congress that supposedly would “ban TikTok.” While it is clearly aimed at TikTok, this bill is really about creating a new Presidential power to remove Americans’ access to apps, websites, games and other entire..."}],"adjacency_reduced_edges":[[3,218],[21,251],[22,164],[24,244],[32,252],[38,142],[41,108],[49,275],[52,187],[52,209],[53,187],[55,144],[60,187],[62,110],[62,127],[62,180],[65,164],[67,136],[67,168],[68,136],[69,164],[69,181],[73,127],[73,240],[76,249],[80,161],[87,260],[93,140],[93,142],[93,168],[93,210],[94,107],[95,187],[96,137],[96,204],[96,208],[96,209],[96,245],[98,103],[98,137],[98,143],[98,158],[98,166],[98,271],[99,107],[99,127],[99,174],[101,107],[102,140],[102,144],[102,186],[102,195],[102,209],[107,136],[108,117],[108,136],[108,140],[110,137],[112,137],[113,137],[113,186],[114,137],[114,187],[115,187],[116,187],[117,144],[117,182],[117,186],[118,144],[123,145],[123,157],[124,125],[124,148],[124,257],[126,133],[127,137],[128,147],[128,259],[129,139],[129,174],[129,189],[129,192],[129,223],[129,285],[131,144],[131,173],[131,195],[134,246],[134,255],[135,137],[135,148],[135,263],[136,144],[136,150],[141,208],[141,270],[143,197],[144,149],[145,154],[145,173],[145,233],[146,151],[146,261],[146,263],[147,158],[147,159],[147,169],[147,170],[147,269],[149,203],[150,156],[151,154],[151,157],[151,275],[152,158],[153,220],[155,245],[156,167],[157,181],[158,214],[160,174],[161,165],[161,174],[161,257],[165,166],[167,172],[167,173],[167,185],[167,195],[168,173],[168,248],[170,249],[171,173],[172,178],[172,186],[174,181],[174,201],[175,178],[175,186],[176,179],[176,189],[176,190],[177,179],[177,263],[186,188],[186,190],[186,220],[186,224],[187,218],[187,243],[190,191],[190,194],[190,202],[190,252],[191,197],[191,201],[191,207],[191,208],[192,200],[195,208],[195,277],[196,224],[196,279],[199,212],[200,216],[200,256],[201,204],[201,213],[201,218],[202,206],[205,240],[205,257],[205,259],[206,222],[206,228],[206,229],[208,210],[208,218],[208,225],[210,238],[211,222],[212,213],[213,217],[213,219],[213,222],[213,232],[215,218],[216,222],[218,230],[218,238],[218,240],[218,263],[219,227],[220,250],[221,222],[221,226],[224,234],[224,243],[224,270],[225,229],[226,228],[226,236],[228,266],[229,243],[229,244],[230,235],[230,253],[230,259],[230,269],[230,271],[231,234],[231,244],[231,246],[232,245],[234,254],[235,264],[236,238],[236,245],[236,266],[238,260],[240,246],[243,269],[244,248],[244,269],[246,251],[246,261],[247,251],[247,274],[248,249],[248,260],[249,253],[249,257],[250,261],[253,286],[254,256],[256,263],[256,268],[256,282],[257,275],[258,262],[258,263],[259,261],[259,272],[261,262],[261,275],[262,264],[262,268],[264,265],[264,283],[266,279],[267,280],[269,276],[270,271],[271,289],[275,282],[276,284],[281,282],[284,286],[286,287]],"networks":[{"nodes":[3,218],"edges":[[3,218]]},{"nodes":[21,251],"edges":[[21,251]]},{"nodes":[22,164],"edges":[[22,164]]},{"nodes":[244,24],"edges":[[24,244]]},{"nodes":[252,32],"edges":[[32,252]]},{"nodes":[142,38],"edges":[[38,142]]},{"nodes":[41,108],"edges":[[41,108]]},{"nodes":[49,275],"edges":[[49,275]]},{"nodes":[187,52,209],"edges":[[52,209],[52,187]]},{"nodes":[53,187],"edges":[[53,187]]},{"nodes":[144,55],"edges":[[55,144]]},{"nodes":[187,60],"edges":[[60,187]]},{"nodes":[127,240,180,205,62,110,73,257,259],"edges":[[62,110],[73,127],[62,180],[62,127],[205,259],[205,240],[73,240],[205,257]]},{"nodes":[65,164],"edges":[[65,164]]},{"nodes":[136,67,168],"edges":[[67,168],[67,136]]},{"nodes":[136,68],"edges":[[68,136]]},{"nodes":[69,164,181],"edges":[[69,164],[69,181]]},{"nodes":[76,249],"edges":[[76,249]]},{"nodes":[161,80],"edges":[[80,161]]},{"nodes":[260,87],"edges":[[87,260]]},{"nodes":[171,142,210,93,140,173,248,168],"edges":[[93,142],[168,173],[171,173],[93,210],[168,248],[93,168],[93,140]]},{"nodes":[107,94],"edges":[[94,107]]},{"nodes":[187,95],"edges":[[95,187]]},{"nodes":[208,204,245,141,155,137,270,96,209],"edges":[[141,270],[96,137],[141,208],[96,209],[96,245],[96,204],[155,245],[96,208]]},{"nodes":[165,137,98,271,249,218,158,159,269,243,152,186,110,112,187,113,115,166,116,103,197,114,147,170,214,143,169],"edges":[[98,103],[147,158],[187,243],[116,187],[147,159],[98,166],[158,214],[114,137],[110,137],[115,187],[98,137],[98,143],[112,137],[113,186],[147,170],[165,166],[152,158],[98,271],[147,169],[170,249],[98,158],[114,187],[113,137],[143,197],[147,269],[187,218]]},{"nodes":[137,107,263,148,127,135,174,99],"edges":[[127,137],[99,174],[99,107],[135,137],[99,127],[135,263],[135,148]]},{"nodes":[101,107],"edges":[[101,107]]},{"nodes":[117,144,182,131,209,195,173,102,118,186,140],"edges":[[131,173],[117,186],[117,182],[131,195],[131,144],[102,195],[102,209],[117,144],[118,144],[102,186],[102,140],[102,144]]},{"nodes":[107,136],"edges":[[107,136]]},{"nodes":[283,218,286,172,186,188,227,108,149,117,243,244,248,275,277,150,156,252,190,197,196,206,228,215,210,234,271,231,264,191,256,257,167,240,185,207,202,220,224,194,259,261,230,279,246,140,282,270,262,289,269,195,284,136,249,217,287,265,238,251,201,250,232,213,268,263,235,281,229,219,173,222,203,208,225,212,253,247,204,245,178,260,144,211,272,276,274,175,254],"edges":[[218,238],[229,244],[144,149],[167,172],[234,254],[270,271],[244,248],[230,253],[243,269],[276,284],[224,243],[261,262],[167,185],[108,136],[213,219],[191,208],[230,235],[244,269],[257,275],[186,220],[201,204],[172,186],[246,251],[230,271],[240,246],[190,191],[248,260],[259,261],[196,279],[206,228],[208,210],[213,232],[247,274],[235,264],[206,229],[247,251],[201,218],[248,249],[230,259],[262,264],[156,167],[281,282],[190,202],[167,173],[225,229],[186,224],[195,208],[172,178],[224,270],[231,234],[150,156],[208,218],[190,194],[250,261],[191,201],[261,275],[229,243],[230,269],[213,222],[246,261],[262,268],[210,238],[191,207],[202,206],[215,218],[175,178],[190,252],[206,222],[195,277],[108,140],[175,186],[218,230],[218,240],[220,250],[249,257],[232,245],[264,265],[264,283],[213,217],[149,203],[191,197],[218,263],[256,282],[231,246],[256,268],[259,272],[208,225],[224,234],[253,286],[254,256],[269,276],[196,224],[186,190],[212,213],[256,263],[136,150],[186,188],[201,213],[108,117],[249,253],[271,289],[284,286],[167,195],[211,222],[286,287],[136,144],[219,227],[231,244],[275,282]]},{"nodes":[157,123,145],"edges":[[123,145],[123,157]]},{"nodes":[125,148,257,124],"edges":[[124,148],[124,257],[124,125]]},{"nodes":[133,126],"edges":[[126,133]]},{"nodes":[147,128,259],"edges":[[128,147],[128,259]]},{"nodes":[226,222,236,139,285,223,266,279,260,221,216,192,245,129,160,189,228,238,174,256,200],"edges":[[200,256],[266,279],[228,266],[129,285],[236,238],[129,174],[129,189],[226,228],[221,226],[226,236],[238,260],[129,139],[200,216],[236,245],[192,200],[160,174],[236,266],[129,223],[216,222],[221,222],[129,192]]},{"nodes":[255,246,134],"edges":[[134,255],[134,246]]},{"nodes":[233,145,154,173],"edges":[[145,173],[145,233],[145,154]]},{"nodes":[146,261,263,151],"edges":[[146,263],[146,151],[146,261]]},{"nodes":[275,181,151,154,157],"edges":[[157,181],[151,157],[151,154],[151,275]]},{"nodes":[153,220],"edges":[[153,220]]},{"nodes":[201,161,257,174,181,165],"edges":[[174,201],[161,174],[174,181],[161,257],[161,165]]},{"nodes":[179,176,189,190],"edges":[[176,190],[176,179],[176,189]]},{"nodes":[179,263,177],"edges":[[177,263],[177,179]]},{"nodes":[212,199],"edges":[[199,212]]},{"nodes":[263,258,262],"edges":[[258,262],[258,263]]},{"nodes":[267,280],"edges":[[267,280]]}]}